package com.xiaoerzuche.biz.zmxy.enu;

/** 
* 字码信用租车行业风险编码枚举
* @author: cyz
* @version: payment-web
* @time: 2017年5月8日
* 
*/
public enum ZMADEnu {
	//逾期未支付AD001
	AD001001("AD001001","逾期1-7天"),
	AD001002("AD001002","逾期8-14天"),
	AD001003("AD001003","逾期15-30天"),
	AD001004("AD001004","逾期31-60天"),
	AD001005("AD001005","逾期61-90天"),
	AD001006("AD001005","逾期91-120天"),
	AD001007("AD001007","逾期121-150天"),
	AD001008("AD001008","逾期151-180天"), 
	AD001009("AD001008","逾期180天以上"),
	
	//逾期未支付金额
	M01("M01","0-500元"),
	M02("M02","500-1000元"),
	M03("M03","1000-2000元"),
	M04("M04","2000-3000元"),
	M05("M05","3000-4000元"),
	M06("M06","4000-6000元"),
	M07("M07","6000-8000元"),
	M08("M08","8000-10000元"),
	M09("M09","10000-15000元"),
	M10("M10","15000-20000元"),
	M11("M11","20000-25000元"),
	M12("M12","25000-30000元"),
	M13("M13","30000-40000元"),
	M14("M14","40000元以上"),
	
	//逾期未还车
	AD002001("AD002001","超期1-7天"),
	AD002002("AD002002","超期8-14天"),
	AD002003("AD002003","超期15-30天"),
	AD002004("AD002004","超期31-60天"), 
	AD002005("AD002005","超期61-90天"), 
	AD002006("AD002006","超期91-120天"), 
	AD002007("AD002007","超期121-150天"), 
	AD002008("AD002008","超期151-180天"), 
	AD002009("AD002009","超期180天以上"), 
	
	//违章未处理
	AD003001("AD003001","超期1-7天"),
	AD003002("AD003002","超期8-14天"),
	AD003003("AD003003","超期15-30天"),
	AD003004("AD003004","超期31-60天"),
	AD003005("AD003005","超期61-90天"),
	AD003006("AD003006","超期91-120天"),
	AD003007("AD003007","超期121-150天"),
	AD003008("AD003008","超期151-180天"),
	AD003009("AD003009","超期180天以上")
	;
	
	private String code;
	private String name;
	
	private ZMADEnu(String code, String name){
		this.code = code;
		this.name = name;
	}
	
	public String getCode() {
		return code;
	}
	public void setCode(String code) {
		this.code = code;
	}
	public String getName() {
		return name;
	}
	public void setName(String name) {
		this.name = name;
	}

}
